app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (name LIKE '%luiz%') ORDER BY name asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "employees" WHERE (name LIKE '%%')
---
	def index
		@employees = Employee.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])

INSERT INTO "employees" ("created_at", "faults_number", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 15 Jan 2013 16:05:06 UTC +00:00], ["faults_number", 3], ["name", "User Teste"], ["updated_at", Tue, 15 Jan 2013 16:05:06 UTC +00:00]]
---
	def create
		@employee = Employee.new(params[:employee])
		respond_to do |format|
    		if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "2"]]
---
	def edit
		@employee = Employee.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "employees" SET "faults_number" = 5, "updated_at" = '2013-01-15 16:48:29.755769' WHERE "employees"."id" = 1
---
	def update
		@employee = Employee.find(params[:id])
		@employee.update_attributes(params[:employee])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
---
	def destroy
		@employee = Employee.find(params[:id])
		if @employee.destroy